app/Controllers/sign/SignUp.php

INSERT INTO `users` (`username`, `email`, `pw`) VALUES ('alter', 'alter@test.com', '$2y$10$CshpH.6KyUfiF2oUyaef6ecEZ6hpvvFvW4iGy65Ao3TqxQ8CWNP7O')
---
    public function insert()
    {
        helper(['form']);
        $rules = [
            'username'  =>  'required|is_unique[users.username]',
            'email'     =>  'required|valid_email|is_unique[users.email]',
            'pw'        =>  'required',
            'confpw'    =>  'required|matches[pw]'
        ];
        if($this->validate($rules))
        {
            $model = new userModel();
            $data = [
                'username'  => $_POST['username'],
                'email'     => $_POST['email'],
                'pw'        => password_hash($_POST['pw'], PASSWORD_DEFAULT)
            ];
            $model->save($data);