app/Controllers/Home.php

SELECT DISTINCT `mtName`
FROM `MTGroup`
WHERE `endMTTime` > '22/02/15 09:36'
 LIMIT 20
SELECT *
FROM `MTGroup`
WHERE `endMTTime` > '22/02/14 04:29'
 LIMIT 20
---
    public function index()
    {
        $mtModel = new MTModel;
        $mtGroupModel = new MTGroupModel;
        $MTList = $mtGroupModel->distinct()->select("mtName")->where('endMTTime > ',  date('y/m/d h:i'))->findAll(20);

        $session = session();
        $data = [
            'meta_title'=> 'home',
            'is_login'  => $session->get('is_login'),
            'username'  => $session->get('username'),
            'MTList'    => $MTList
        ];

SELECT *
FROM `MTGroup`
WHERE `mtName` = 't1'
---
    public function event($mtName){
        $mtModel = new MTModel;
        $mtGroupModel = new MTGroupModel;
        $mt = $mtModel->where("mtName", $mtName)->findAll();
        $mtGroupList = $mtGroupModel->where("mtName", $mtName)->findAll();