app/Controllers/Manage.php

    public function mgOf($mtName){
        $mt = (new MTModel())->where('mtName',$mtName)->first();
        $session = session();
        if($session->get('is_login')){
            if($session->get('_id') == $mt['_id']){
                $groups = (new MTGroupModel())->where('mtName', $mtName)->findAll();
---
SELECT *
FROM `MTGroup`
WHERE `mtName` = 't2'

    public function groupinfo($gid){
        $group = (new MTGroupModel())->where('_gid',$gid)->first();
---
SELECT *
FROM `MTGroup`
WHERE `_gid` = '12'
 LIMIT 1

    public function reviseGroup($gid){
        $group = (new MTGroupModel())->where('_gid',$gid)->first();
---
SELECT *
FROM `MTGroup`
WHERE `_gid` = '12'
 LIMIT 1