app/Controllers/MTPage.php

SELECT *
FROM `MTGroup`
WHERE `mtName` = 't1'
---
    public function mtOf($mtName)
    {
        $session = session();
        $mtModel = new MTModel();
        $mtGroupModel = new MTGroupModel();
        $mt = $mtModel->where("mtName", $mtName)->findAll();
        $mtModel->set("viewCount", "viewCount+1", false)->where("mtName",$mtName)->update();
        $mtGroupList = $mtGroupModel->where("mtName", $mtName)->findAll();
        $data = [
            'is_login'  => $session->get('is_login'),
            'username'  => $session->get('username'),
            'meta_title'    => 'mtpage',
            'mt'            => $mt[0],
            'mtGroupList'   => $mtGroupList
        ];