app/Controllers/MyPage.php

    public function index()
    {
        $session = session();
        if($session->get('is_login'))
        {

            $mt = new MTModel();
            $user = (new userModel())->where('_id',$session->get('_id'))->findAll();
            $requestMT = new RequestMTModel();
            $mts = $mt->where('_id', $session->get('_id'))->findAll();
            $requests = $requestMT->select('requestMT._rid, requestMT.reason, requestMT.Approval, MTGroup.mtName, MTGroup.groupname, MTGroup.startMTTime, MTGroup.endMTTime')
            ->join('MTGroup', 'requestMT._gid = MTGroup._gid', 'inner')
            ->where('_id', $session->get('_id'))
            ->findAll();

            $data = [
                'mts'           => $mts,
                'user'          => $user,
                'requests'      => $requests,
                'is_login'      => $session->get('is_login'),
                'username'      => $session->get('username'),
                'meta_title'    => 'MyPage'
            ];
---
SELECT `requestMT`.`reason`, `requestMT`.`Approval`, `MTGroup`.`mtName`, `MTGroup`.`groupname`, `MTGroup`.`startMTTime`, `MTGroup`.`endMTTime`
FROM `requestMT`
INNER JOIN `MTGroup` ON `requestMT`.`_gid` = `MTGroup`.`_gid`
WHERE `_id` = '6'
SELECT *
FROM `users`
WHERE `_id` = '6'

    public function reviseUser()
    {
        $session = session();
        if($session->get('is_login')){
            $user = (new userModel())->where('_id',$session->get('_id'))->first();
            $data = [
                'user'          => $user,
                'is_login'      => $session->get('is_login'),
                'username'      => $session->get('username'),
                'meta_title'    => 'reviseUser'
            ];
---
SELECT *
FROM `users`
WHERE `_id` = '6'
 LIMIT 1